pancakeIceModel/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // domain
    (-5 -1 -0.5)    // 0
    (5 -1 -0.5)     // 1
    (5 1.6 -0.5)    // 2
    (-5 1.6 -0.5)   // 3
    (-5 -1 1.5)     // 4
    (5 -1 1.5)      // 5
    (5 1.6 1.5)     // 6
    (-5 1.6 1.5)    // 7
    // free surface refinement region
    (-5 -1 0.4)     // 8
    (5 -1 0.4)      // 9
    (5 1.6 0.4)     // 10
    (-5 1.6 0.4)    // 11
    (-5 -1 0.6)     // 12
    (5 -1 0.6)      // 13
    (5 1.6 0.6)     // 14
    (-5 1.6 0.6)    // 15
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (200 52 40) simpleGrading (1 1 1)
    hex (0 1 2 3 8 9 10 11) (300 78 27) simpleGrading (1 1 -3)       // water region
    hex (8 9 10 11 12 13 14 15) (300 78 20) simpleGrading (1 1 1) // free surface refinement region
    hex (12 13 14 15 4 5 6 7) (300 78 27) simpleGrading (1 1 3)       // air region
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    inlet
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            (0 8 11 3)
            (8 12 15 11)
            (12 4 7 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            //(2 6 5 1)
            (2 10 9 1)
            (10 14 13 9)
            (14 6 5 13)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type patch;
        faces
        (
            //(0 1 5 4)
            (0 1 9 8)
            (8 9 13 12)
            (12 13 5 4)
            //(3 7 6 2)
            (3 11 10 2)
            (11 15 14 10)
            (15 7 6 14)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
